---
title: FamilyElementVisibility
classe: Autodesk.Revit.DB.FamilyElementVisibility
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# FamilyElementVisibility

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsShownInCoarse { get; set; }` | `familyElementVisibility.IsShownInCoarse` | Boolean |
| `Boolean IsShownInFine { get; set; }` | `familyElementVisibility.IsShownInFine` | Boolean |
| `Boolean IsShownInFrontBack { get; set; }` | `familyElementVisibility.IsShownInFrontBack` | Boolean |
| `Boolean IsShownInLeftRight { get; set; }` | `familyElementVisibility.IsShownInLeftRight` | Boolean |
| `Boolean IsShownInMedium { get; set; }` | `familyElementVisibility.IsShownInMedium` | Boolean |
| `Boolean IsShownInPlanRCPCut { get; set; }` | `familyElementVisibility.IsShownInPlanRCPCut` | Boolean |
| `Boolean IsShownInTopBottom { get; set; }` | `familyElementVisibility.IsShownInTopBottom` | Boolean |
| `Boolean IsShownOnlyWhenCut { get; set; }` | `familyElementVisibility.IsShownOnlyWhenCut` | Boolean |
| `FamilyElementVisibilityType VisibilityType { get; }` | `familyElementVisibility.VisibilityType` | FamilyElementVisibilityType |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```